gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
/****************************************************************************
 * arch/arm/src/ra6m5/ra6m5_eth.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#if defined(CONFIG_NET) && defined(CONFIG_RA6M5_EMAC)

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include <debug.h>
#include <errno.h>

#include <arpa/inet.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/queue.h>
#include <nuttx/wqueue.h>
#include <nuttx/wdog.h>
#include <nuttx/signal.h>
#include <nuttx/net/phy.h>
#include <nuttx/net/mii.h>
#include <nuttx/net/netdev.h>

#if defined(CONFIG_ARCH_PHY_INTERRUPT)
#  include <nuttx/net/phy.h>
#endif

#if defined(CONFIG_NET_PKT)
#  include <nuttx/net/pkt.h>
#endif

#include "ra6m5_eth.h"
#include "ra6m5_rcc.h"

#include <arch/board/board.h>

#if RA6M5_NETHERNET > 0

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Timing *******************************************************************/

/* TX timeout = 1 minute */

#define RA6M5_TXTIMEOUT   (60*CLK_TCK)
#define MII_MAXPOLLS      (0x1ffff)
#define LINK_WAITUS       (500*1000)
#define LINK_NLOOPS       (10)

/* PHY definitions.
 *
 * The selected PHY must be selected from the drivers/net/Kconfig PHY menu.
 * A description of the PHY must be provided here.  That description must
 * include:
 *
 * 1. BOARD_PHY_NAME: A PHY name string (for debug output),
 * 2. BOARD_PHYID1 and BOARD_PHYID2: The PHYID1 and PHYID2 values (from
 *    include/nuttx/net/mii.h)
 * 3. BOARD_PHY_STATUS:  The address of the status register to use when
 *    querying link status (from include/nuttx/net/mii.h)
 * 4. BOARD_PHY_ISDUPLEX:  A macro that can convert the status register
 *    value into a boolean: true=duplex mode, false=half-duplex mode
 * 5. BOARD_PHY_10BASET:  A macro that can convert the status register
 *    value into a boolean: true=10Base-T, false=Not 10Base-T
 * 6. BOARD_PHY_100BASET:  A macro that can convert the status register
 *    value into a boolean: true=100Base-T, false=Not 100Base-T
 *
 */

#if defined(CONFIG_ETH0_PHY_KSZ8041)
#  define BOARD_PHY_NAME        "KSZ8041"
#  define BOARD_PHYID1          MII_PHYID1_KSZ8041
#  define BOARD_PHYID2          MII_PHYID2_KSZ8041
#  define BOARD_PHY_STATUS      MII_KSZ8041_PHYCTRL2
#  define BOARD_PHY_10BASET(s)  (((s) & MII_PHYCTRL2_MODE_10HDX) != 0)
#  define BOARD_PHY_100BASET(s) (((s) & MII_PHYCTRL2_MODE_100HDX) != 0)
#  define BOARD_PHY_ISDUPLEX(s) (((s) & MII_PHYCTRL2_MODE_DUPLEX) != 0)
#  define MII_INT_REG           MII_KSZ8041_INT
#  define MII_INT_SETEN         MII_KSZ80X1_INT_LDEN | MII_KSZ80X1_INT_LUEN
#  define MII_INT_CLREN         0
#  define MII_INT_LINK_SHIFT    8
#  define MII_INT_LINK_STAT     (1 << MII_INT_LINK_SHIFT)
#elif defined(CONFIG_ETH0_PHY_KSZ8081)
#  define BOARD_PHY_NAME        "KSZ8081"
#  define BOARD_PHYID1          MII_PHYID1_KSZ8081
#  define BOARD_PHYID2          MII_PHYID2_KSZ8081
#  define BOARD_PHY_STATUS      MII_KSZ8081_PHYCTRL1
#  define BOARD_PHY_10BASET(s)  (((s) & MII_PHYCTRL1_MODE_10HDX) != 0)
#  define BOARD_PHY_100BASET(s) (((s) & MII_PHYCTRL1_MODE_100HDX) != 0)
#  define BOARD_PHY_ISDUPLEX(s) (((s) & MII_PHYCTRL1_MODE_DUPLEX) != 0)
#  define MII_INT_REG           MII_KSZ8081_INT
#  define MII_INT_SETEN         MII_KSZ80X1_INT_LDEN | MII_KSZ80X1_INT_LUEN
#  define MII_INT_CLREN         0
#  define MII_INT_LINK_SHIFT    8
#  define MII_INT_LINK_STAT     (1 << MII_INT_LINK_SHIFT)
#else
#  error "Unrecognized or missing PHY selection"
#endif

#if RA6M5_NETHERNET > 1
#  error "Logic to support multiple Ethernet interfaces is incomplete"
#endif

#define RA6M5_EMAC0_DEVNAME "eth0"

/* Work queue support is required. */

#if !defined (CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#endif

/* The low priority work queue is preferred.  If it is not enabled, LPWORK
 * will be the same as HPWORK.
 *
 * NOTE:  However, the network should NEVER run on the high priority work
 * queue!  That queue is intended only to service short back end interrupt
 * processing that never suspends.  Suspending the high priority work queue
 * may bring the system to its knees!
 */

#define ETHWORK LPWORK

#if !defined(CONFIG_RA6M5_EMAC0_MII) && !defined(CONFIG_RA6M5_EMAC0_RMII)
#  warning "Neither CONFIG_RA6M5_EMAC0_MII nor CONFIG_RA6M5_EMAC0_RMII defined"
#endif

#if defined(CONFIG_RA6M5_EMAC0_MII) && defined(CONFIG_RA6M5_EMAC0_RMII)
#  error "Both CONFIG_RA6M5_EMAC0_MII and CONFIG_RA6M5_EMAC0_RMII defined"
#endif

#ifdef CONFIG_RA6M5_EMAC0_AUTONEG
#  ifndef CONFIG_RA6M5_EMAC0_PHYSR
#    error "CONFIG_RA6M5_EMAC0_PHYSR must be defined in the NuttX configuration"
#  endif
#  ifdef CONFIG_RA6M5_EMAC0_PHYSR_ALTCONFIG
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_ALTMODE
#      error "CONFIG_RA6M5_EMAC0_PHYSR_ALTMODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_10HD
#      error "CONFIG_RA6M5_EMAC0_PHYSR_10HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_100HD
#      error "CONFIG_RA6M5_EMAC0_PHYSR_100HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_10FD
#      error "CONFIG_RA6M5_EMAC0_PHYSR_10FD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_100FD
#      error "CONFIG_RA6M5_EMAC0_PHYSR_100FD must be defined in the NuttX configuration"
#    endif
#  else
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_SPEED
#      error "CONFIG_RA6M5_EMAC0_PHYSR_SPEED must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_100MBPS
#      error "CONFIG_RA6M5_EMAC0_PHYSR_100MBPS must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_MODE
#      error "CONFIG_RA6M5_EMAC0_PHYSR_MODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RA6M5_EMAC0_PHYSR_FULLDUPLEX
#      error "CONFIG_RA6M5_EMAC0_PHYSR_FULLDUPLEX must be defined in the NuttX configuration"
#    endif
#  endif
#endif

/* This driver does not use enhanced descriptors.  Enhanced descriptors must
 * be used, however, if time stamping and/or IPv4 checksum offload is
 * supported.
 */

#undef CONFIG_RA6M5_ETH_ENHANCEDDESC
#undef CONFIG_RA6M5_ETH_HWCHECKSUM

/* Add 4 to the configured buffer size to account for the 2 byte checksum
 * memory needed at the end of the maximum size packet.  Buffer sizes must
 * be an even multiple of 4, 8, 16 or 32bytes (depending on buswidth).  We
 * will use the 32-byte alignment in all cases.
 */

#define OPTIMAL_ETH_BUFSIZE ((CONFIG_NET_ETH_PKTSIZE + 4 + 31) & ~31)

