gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
struct eth_rxdesc_s
{
  volatile uint32_t rdes0;   /* Indicates receive frame status */

  /* Indicates receive buffer length when reception is completed,
   * the receive frame length is return back
   */

  volatile uint32_t rdes1;
  volatile uint32_t rdes2;   /* Indicates the start address of  the receive buffer  */
  volatile uint32_t rdes3;   /* next descriptor address pointer */
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The ra6m5_ethmac_s encapsulates all state information for a single
 * hardware interface
 */

struct ra6m5_ethmac_s
{
  /* Descriptor allocations */

  struct eth_rxdesc_s rxtable[CONFIG_RA6M5_ETH_NRXDESC];
  struct eth_txdesc_s txtable[CONFIG_RA6M5_ETH_NTXDESC];

  /* Buffer allocations */

  uint8_t rxbuffer[CONFIG_RA6M5_ETH_NRXDESC*CONFIG_RA6M5_ETH_BUFSIZE];
  uint8_t alloc[RA6M5_ETH_NFREEBUFFERS*CONFIG_RA6M5_ETH_BUFSIZE];
  uint8_t              ifup    : 1; /* true:ifup false:ifdown */
  uint8_t              mbps100 : 1; /* 100MBps operation (vs 10 MBps) */
  uint8_t              fduplex : 1; /* Full (vs. half) duplex */
  struct wdog_s        txtimeout;   /* TX timeout timer */
  struct work_s        irqwork;     /* For deferring interrupt work to the work queue */
  struct work_s        pollwork;    /* For deferring poll work to the work queue */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s  dev;         /* Interface understood by the network */

  /* Used to track transmit and receive descriptors */

  struct eth_txdesc_s *txhead;      /* Next available TX descriptor */
  struct eth_rxdesc_s *rxhead;      /* Next available RX descriptor */

  struct eth_txdesc_s *txtail;      /* First "in_flight" TX descriptor */
  struct eth_rxdesc_s *rxcurr;      /* First RX descriptor of the segment */
  uint16_t             segments;    /* RX segment count */
  uint16_t             inflight;    /* Number of TX transfers "in_flight" */
  sq_queue_t           freeb;       /* The free buffer list */

  uint32_t             prevlinkstatus; /* Previous link status to ignore multiple link change interrupt (specific to GR-Rose) */
  uint8_t              mc_filter_flag; /* Multicast filter */
  uint8_t              phyaddr;        /* PHY address */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

NX_ALIGN32 static struct ra6m5_ethmac_s g_rx65nethmac[RA6M5_NETHERNET];

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations */

#if defined(CONFIG_RA6M5_EMAC_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t ra6m5_getreg(uint32_t addr);
static void ra6m5_putreg(uint32_t val, uint32_t addr);
static void ra6m5_checksetup(void);
#else
#  define ra6m5_getreg(addr)     getreg32(addr)
#  define ra6m5_putreg(val,addr) putreg32(val,addr)
#  define ra6m5_checksetup()
#endif

/* Debug */

/* Extra, in-depth debug output that is only available if
 * CONFIG_NETDEV_PHY_DEBUG us defined.
 */

#ifdef CONFIG_NETDEV_PHY_DEBUG
#  define phyerr    _err
#  define phywarn   _warn
#  define phyinfo   _info
#else
#  define phyerr(x...)
#  define phywarn(x...)
#  define phyinfo(x...)
#endif

/* Free buffer management */

static void ra6m5_initbuffer(struct ra6m5_ethmac_s *priv);
static inline uint8_t *ra6m5_allocbuffer(struct ra6m5_ethmac_s *priv);
static inline void ra6m5_freebuffer(struct ra6m5_ethmac_s *priv,
                                    uint8_t *buffer);
static inline bool ra6m5_isfreebuffer(struct ra6m5_ethmac_s *priv);

/* Common TX logic */

static int  ra6m5_transmit(struct ra6m5_ethmac_s *priv);
static int  ra6m5_txpoll(struct net_driver_s *dev);
static void ra6m5_dopoll(struct ra6m5_ethmac_s *priv);

/* Interrupt handling */

static void ra6m5_enableint(struct ra6m5_ethmac_s *priv,
                            uint32_t ierbit);
static void ra6m5_disableint(struct ra6m5_ethmac_s *priv,
                             uint32_t ierbit);

static void ra6m5_freesegment(struct ra6m5_ethmac_s *priv,
                              struct eth_rxdesc_s *rxfirst, int segments);
static int  ra6m5_recvframe(struct ra6m5_ethmac_s *priv);
static void ra6m5_receive(struct ra6m5_ethmac_s *priv);
static void ra6m5_freeframe(struct ra6m5_ethmac_s *priv);
static void ra6m5_txdone(struct ra6m5_ethmac_s *priv);

static void ra6m5_interrupt_work(void *arg);
static int  ra6m5_interrupt(int irq, void *context, void *arg);

/* Watchdog timer expirations */

static void ra6m5_txtimeout_work(void *arg);
static void ra6m5_txtimeout_expiry(wdparm_t arg);

/* NuttX callback functions */

static int  ra6m5_ifup(struct net_driver_s *dev);
static int  ra6m5_ifdown(struct net_driver_s *dev);

static void ra6m5_txavail_work(void *arg);
static int  ra6m5_txavail(struct net_driver_s *dev);

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int  ra6m5_addmac(struct net_driver_s *dev, const uint8_t *mac);
#endif
#ifdef CONFIG_NET_MCASTGROUP
static int  ra6m5_rmmac(struct net_driver_s *dev, const uint8_t *mac);
#endif
#ifdef CONFIG_NETDEV_IOCTL
static int  ra6m5_ioctl(struct net_driver_s *dev, int cmd,
                        unsigned long arg);
#endif

/* Descriptor Initialization */

static void ra6m5_txdescinit(struct ra6m5_ethmac_s *priv);
static void ra6m5_rxdescinit(struct ra6m5_ethmac_s *priv);

/* PHY Initialization */

#if defined(CONFIG_NETDEV_PHY_IOCTL) && defined(CONFIG_ARCH_PHY_INTERRUPT)
static void ra6m5_phyintenable(bool enable);
#endif
#if defined(CONFIG_ARCH_PHY_INTERRUPT)
int arch_phy_irq(const char *intf, xcpt_t handler, void *arg,
                 phy_enable_t *enable);
#endif
static int  ra6m5_phyinit(struct ra6m5_ethmac_s *priv);

/* MAC/DMA Initialization */

