gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
  /* Verify that the hardware is ready to send another packet.  If we get
   * here, then we are committed to sending a packet; Higher level logic
   * must have assured that there is no transmission in progress.
   */

  txdesc  = priv->txhead;
  txfirst = txdesc;

  ninfo("d_len: %d d_buf: %p txhead: %p tdes0: %08" PRIx32 "\n",
        priv->dev.d_len, priv->dev.d_buf, txdesc, txdesc->tdes0);

  DEBUGASSERT(txdesc && (txdesc->tdes0 & TACT) == 0);

  /* Is the size to be sent greater than the size of the Ethernet buffer? */

  DEBUGASSERT(priv->dev.d_len > 0 && priv->dev.d_buf != NULL);

  /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_packets)++;
#endif

#if OPTIMAL_ETH_BUFSIZE > CONFIG_RA6M5_ETH_BUFSIZE
  if (priv->dev.d_len > CONFIG_RA6M5_ETH_BUFSIZE)
    {
      /* Yes... how many buffers will be need to send the packet? */

      bufcount = (priv->dev.d_len +
                 (CONFIG_RA6M5_ETH_BUFSIZE - 1)) / CONFIG_RA6M5_ETH_BUFSIZE;
      lastsize = priv->dev.d_len - (bufcount - 1) * CONFIG_RA6M5_ETH_BUFSIZE;

      ninfo("bufcount: %d lastsize: %d\n", bufcount, lastsize);

      /* Set the first segment bit in the first TX descriptor */

      txdesc->tdes0 |= TFP1;

      /* Set up all but the last TX descriptor */

      buffer = priv->dev.d_buf;

      for (i = 0; i < bufcount; i++)
        {
          /* This could be a normal event but the design does not handle it */

          DEBUGASSERT((txdesc->tdes0 & TACT) == 0);

          /* Set the Buffer1 address pointer */

          txdesc->tdes2 = (uint32_t)buffer;

          /* Set the buffer size in all TX descriptors */

          if (i == (bufcount - 1))
            {
              /* This is the last segment.  Set the last segment bit in the
               * last TX descriptor and ask for an interrupt when this
               * segment transfer completes.
               */

              txdesc->tdes0 |= (TFP0 | TWBI);

              /* This segment is, most likely, of fractional buffersize */

              txdesc->tdes1  = (lastsize << 16);
              buffer        += lastsize;
            }
          else
            {
              /* This is not the last segment.  We don't want an interrupt
               * when this segment transfer completes.
               */

              txdesc->tdes0 &= ~TWBI;

              /* The size of the transfer is the whole buffer */

              txdesc->tdes1  = (CONFIG_RA6M5_ETH_BUFSIZE << 16);
              buffer        += CONFIG_RA6M5_ETH_BUFSIZE;
            }

          /* Give the descriptor to DMA */

          txdesc->tdes0 |= TACT;
          regval  = ra6m5_getreg(RA6M5_ETHD_EDTRR);
          regval |= (ETHD_EDRRR_TR);
          ra6m5_putreg(regval, RA6M5_ETHD_EDTRR);

          txdesc = (struct eth_txdesc_s *)txdesc->tdes3;
        }
    }
  else
#endif
    {
      /* The single descriptor is both the first and last segment.  And we do
       * want an interrupt when the transfer completes.
       */

      txdesc->tdes0 |= (TFP0 | TFP1 | TWBI);

      /* Set frame size */

      DEBUGASSERT(priv->dev.d_len <= CONFIG_NET_ETH_PKTSIZE);
      txdesc->tdes1 = ((priv->dev.d_len) << 16);

      /* Set the Buffer1 address pointer */

      txdesc->tdes2 = (uint32_t)priv->dev.d_buf;

      /* Set OWN bit of the TX descriptor tdes0.  This gives the buffer to
       * Ethernet DMA
       */

      txdesc->tdes0 |= TACT;
      regval  = ra6m5_getreg(RA6M5_ETHD_EDTRR);
      regval |= (ETHD_EDRRR_TR);
      ra6m5_putreg(regval, RA6M5_ETHD_EDTRR);

      /* Point to the next available TX descriptor */

      txdesc = (struct eth_txdesc_s *)txdesc->tdes3;
    }

  /* Remember where we left off in the TX descriptor chain */

  priv->txhead = txdesc;

  /* Detach the buffer from priv->dev structure.  That buffer is now
   * "in-flight".
   */

  priv->dev.d_buf = NULL;
  priv->dev.d_len = 0;

  /* If there is no other TX buffer, in flight, then remember the location
   * of the TX descriptor.  This is the location to check for TX done events.
   */

  if (!priv->txtail)
    {
      DEBUGASSERT(priv->inflight == 0);
      priv->txtail = txfirst;
    }

  /* Increment the number of TX transfer in-flight */

  priv->inflight++;

  ninfo("txhead: %p txtail: %p inflight: %d\n",
        priv->txhead, priv->txtail, priv->inflight);

  /* If all TX descriptors are in-flight, then we
   * have to disable receive interrupts
   * too.  This is because receive events
   * can trigger more un-stoppable transmit
   * events.
   */

  if (priv->inflight >= CONFIG_RA6M5_ETH_NTXDESC)
    {
      ra6m5_disableint(priv, ETHD_EESIPR_FRIP);
    }

  /* Enable TX interrupts */

  ra6m5_enableint(priv, ETHD_EESIPR_TCIP);

  /* Setup the TX timeout watchdog (perhaps restarting the timer) */

  wd_start(&priv->txtimeout, RA6M5_TXTIMEOUT,
           ra6m5_txtimeout_expiry, (wdparm_t)priv);

  return OK;
}

/****************************************************************************
 * Function: ra6m5_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network
 *   has any outgoing packets ready
 *   to send.  This is a callback from devif_poll().
 *    devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static int ra6m5_txpoll(struct net_driver_s *dev)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)dev->d_private;

  DEBUGASSERT(priv->dev.d_buf != NULL);

  /* Send the packet */

  ra6m5_transmit(priv);
  DEBUGASSERT(dev->d_len == 0 && dev->d_buf == NULL);

