gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
        if (phylinknotification.phandler != NULL)
          {
            phylinknotification.phandler(irqno, NULL,
                                          phylinknotification.pclient);
            priv->prevlinkstatus = regval;
          }
      }
#endif

  /* Get the interrupt status bits (ETHERC/EDMAC interrupt status check ) */

  edmasr = ra6m5_getreg(RA6M5_ETHD_EESR);

  /* Mask only enabled interrupts.  This depends on the
   * fact that the interrupt
   * related bits (0-16) correspond in these two registers.
   */

  edmasr &= ra6m5_getreg(RA6M5_ETHD_EESIPR);

  /* Yes.. Check if we received an incoming packet,
   * if so, call
   * ra6m5_receive()
   */

  if ((edmasr & ETHD_EESR_FR) != 0)
    {
      /* Clear the pending receive interrupt */

      ra6m5_putreg(ETHD_EESR_FR, RA6M5_ETHD_EESR);

      /* Handle the received package */

      ra6m5_receive(priv);
    }

  /* Check if a packet transmission just completed.
   * If so, call ra6m5_txdone(). This may disable further
   * TX interrupts if there are no pending transmissions.
   */

  if ((edmasr & ETHD_EESR_TC) != 0)
    {
      /* Clear the pending transmit interrupt */

      ra6m5_putreg(ETHD_EESR_TC, RA6M5_ETHD_EESR);

      /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_done)++;
#endif

      /* Check if there are pending transmissions */

      ra6m5_txdone(priv);
    }

  net_unlock();

  /* Re-enable Ethernet interrupts */

  up_enable_irq(RA6M5_IRQ_ETH);
}

/****************************************************************************
 * Function: ra6m5_interrupt
 *
 * Description:
 *   Hardware interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_interrupt(int irq, void *context, void *arg)
{
  struct ra6m5_ethmac_s *priv = &g_rx65nethmac[0];
  uint32_t edmasr;

  /* Get the interrupt status bits (ETHERC/EDMAC interrupt status check ) */

  edmasr = ra6m5_getreg(RA6M5_ETHD_EESR);
  if (edmasr != 0)
    {
      /* Disable further Ethernet interrupts.  Because Ethernet interrupts
       * are also disabled if the TX timeout event occurs, there can be no
       * race condition here.
       */

      up_disable_irq(RA6M5_IRQ_ETH);

      /* Check if a packet transmission just completed. */

      if ((edmasr & ETHD_EESR_TC) != 0)
        {
          /* If a TX transfer just completed, then cancel the TX timeout so
           * there will be no race condition between any subsequent timeout
           * expiration and the deferred interrupt processing.
           */

          wd_cancel(&priv->txtimeout);
        }

      /* Schedule to perform the interrupt processing on the worker thread. */

      work_queue(ETHWORK, &priv->irqwork, ra6m5_interrupt_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: ra6m5_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Ethernet interrupts are disabled
 *
 ****************************************************************************/

static void ra6m5_txtimeout_work(void *arg)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)arg;

  /* Reset the hardware.Just take the interface down, then back up again. */

  net_lock();

  /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_errors)++;
  (priv->dev.d_statistics.tx_timeouts)++;
#endif

  ra6m5_ifdown(&priv->dev);
  ra6m5_ifup(&priv->dev);

  /* Then poll for new XMIT data */

  ra6m5_dopoll(priv);
  net_unlock();
}

/****************************************************************************
 * Function: ra6m5_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

void ra6m5_txtimeout_expiry(wdparm_t arg)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)arg;
  nerr("ERROR: Timeout!\n");

  /* Disable further Ethernet interrupts.  This will prevent some race
   * conditions with interrupt work.  There is still a potential race
   * condition with interrupt work that is already queued and in progress.
   *
   * Interrupts will be re-enabled when ra6m5_ifup() is called.
   */

  up_disable_irq(RA6M5_IRQ_ETH);

  /* Schedule to perform the TX timeout processing on the worker thread,
   * perhaps canceling any pending IRQ processing.
   */

  work_queue(ETHWORK, &priv->irqwork, ra6m5_txtimeout_work, priv, 0);
}

/****************************************************************************
 * Function: ra6m5_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   Zero is returned on success; a negated errno value is returned on any
 *   failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_ifup(struct net_driver_s *dev)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)dev->d_private;
  int ret;

#ifdef CONFIG_NET_IPv4
  ninfo("Bringing up: %d.%d.%d.%d\n",
        (int)(dev->d_ipaddr & 0xff),
        (int)((dev->d_ipaddr >> 8) & 0xff),
        (int)((dev->d_ipaddr >> 16) & 0xff),
        (int)(dev->d_ipaddr >> 24));
#endif
#ifdef CONFIG_NET_IPv6
  ninfo("Bringing up: %04x:%04x:%04x:%04x:%04x:%04x:%04x:%04x\n",
        dev->d_ipv6addr[0], dev->d_ipv6addr[1], dev->d_ipv6addr[2],
        dev->d_ipv6addr[3], dev->d_ipv6addr[4], dev->d_ipv6addr[5],
        dev->d_ipv6addr[6], dev->d_ipv6addr[7]);
#endif

  /* Configure the Ethernet interface for DMA operation. */

  ret = ra6m5_ethconfig(priv);
  if (ret < 0)
    {
      return ret;
    }

  priv->ifup = true;

