gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
  /* Enable the Ethernet interrupt */

  up_enable_irq(RA6M5_IRQ_ETH);

  priv->prevlinkstatus = ETHER_LINKUP;
  ra6m5_checksetup();
  return OK;
}

/****************************************************************************
 * Function: ra6m5_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   Returns zero on success; a negated errno value is returned on any
 *   failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_ifdown(struct net_driver_s *dev)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)dev->d_private;
  irqstate_t flags;
  int ret = OK;
  ninfo("Taking the network down\n");
  flags = enter_critical_section();

  /* Disable the Ethernet interrupt */

  up_disable_irq(RA6M5_IRQ_ETH);

  /* Cancel the TX timeout timers */

  wd_cancel(&priv->txtimeout);

  /* Put the EMAC in its reset, non-operational state.
   * This should be a known configuration that will guarantee
   * the ra6m5_ifup() always successfully brings the interface back up.
   */

  ret = ra6m5_ethreset(priv);
  if (ret < 0)
    {
      nerr("ERROR: ra6m5_ethreset failed (timeout), "
           "still assuming it's going down.\n");
    }

  /* Mark the device "down" */

  priv->ifup = false;

  priv->prevlinkstatus = ETHER_LINKDOWN;

  leave_critical_section(flags);
  return ret;
}

/****************************************************************************
 * Function: ra6m5_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg  - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void ra6m5_txavail_work(void *arg)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)arg;

  ninfo("ifup: %d\n", priv->ifup);

  /* Ignore the notification if the interface is not yet up */

  net_lock();
  if (priv->ifup)
    {
      /* Poll the network for new XMIT data */

      ra6m5_dopoll(priv);
    }

  net_unlock();
}

/****************************************************************************
 * Function: ra6m5_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int ra6m5_txavail(struct net_driver_s *dev)
{
  struct ra6m5_ethmac_s *priv = (struct ra6m5_ethmac_s *)dev->d_private;

  /* Is our single work structure available?
   * It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&priv->pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->pollwork, ra6m5_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: ra6m5_addmac
 *
 * Description:
 *   NuttX Callback: Add the specified MAC address to the hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be added
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int ra6m5_addmac(struct net_driver_s *dev, const uint8_t *mac)
{
  ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  /* RA6M5 do not support add on mac multi cast feature because related
   * hash table mac multi cast register is not supported in RA6M5.
   */

  return OK;
}
#endif /* CONFIG_NET_MCASTGROUP || CONFIG_NET_ICMPv6 */

/****************************************************************************
 * Function: ra6m5_rmmac
 *
 * Description:
 *   NuttX Callback: Remove the specified MAC address from the
 *   hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be removed
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NET_MCASTGROUP
static int ra6m5_rmmac(struct net_driver_s *dev, const uint8_t *mac)
{
  ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  /* RA6M5 do not support add on mac multi cast feature because related
   * hash table multi cast mac register not available. This function is
   * not need to implement.
   */

  return OK;
}
#endif

/****************************************************************************
 * Function: ra6m5_txdescinit
 *
 * Description:
 *   Initializes the DMA TX descriptors in chain mode.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void ra6m5_txdescinit(struct ra6m5_ethmac_s *priv)
{
  struct eth_txdesc_s *txdesc;
  int i;

  /* priv->txhead will point to the first, available TX descriptor in
   * the chain.
   * Set the priv->txhead pointer to the first descriptor in the table.
   */

  priv->txhead = priv->txtable;

  /* priv->txtail will point to the first segment
   * of the oldest pending "in-flight" TX transfer.
   * NULL means that there are no active TX transfers.
   */

  priv->txtail   = NULL;
  priv->inflight = 0;

