gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
  ret = ra6m5_phyread(priv->phyaddr, MII_INT_REG, &phyval);
  if (ret == OK)
    {
      /* Enable link up/down interrupts */
      if (enable)
        {
          ra6m5_phywrite(priv->phyaddr, MII_INT_REG, (phyval & ~MII_INT_CLREN) | MII_INT_SETEN);
        }

      /* Disable link up/down interrupts */
      else
        {
          ra6m5_phywrite(priv->phyaddr, MII_INT_REG, (phyval & ~MII_INT_CLREN));
        }
    }
}
#endif

/****************************************************************************
 * Name: arch_phy_irq
 *
 * Description:
 *   This function may be called to register an interrupt handler that will
 *   be called when a PHY interrupt occurs.  This function both attaches
 *   the interrupt handler and enables the interrupt if 'handler' is non-
 *   NULL.  If handler is NULL, then the interrupt is detached and disabled
 *   instead.
 *
 *   The PHY interrupt is always disabled upon return.  The caller must
 *   call back through the enable function point to control the state of
 *   the interrupt.
 *
 *   This interrupt may or may not be available on a given platform depending
 *   on how the network hardware architecture is implemented.  In a typical
 *   case, the PHY interrupt is provided to board-level logic as a GPIO
 *   interrupt (in which case this is a board-specific interface and really
 *   should be called board_phy_irq()); In other cases, the PHY interrupt
 *   may be cause by the chip's MAC logic (in which case arch_phy_irq()) is
 *   an appropriate name.  Other other boards, there may be no PHY interrupts
 *   available at all.  If client attachable PHY interrupts are available
 *   from the board or from the chip, then CONFIG_ARCH_PHY_INTERRUPT should
 *   be defined to indicate that fact.
 *
 *   Typical usage:
 *   a. OS service logic (not application logic*) attaches to the PHY
 *      PHY interrupt and enables the PHY interrupt.
 *   b. When the PHY interrupt occurs:  (1) the interrupt should be
 *      disabled and () work should be scheduled on the worker thread (or
 *      perhaps a dedicated application thread).
 *   c. That worker thread should use the SIOCGMIIPHY, SIOCGMIIREG,
 *      and SIOCSMIIREG ioctl calls** to communicate with the PHY,
 *      determine what network event took place (Link Up/Down?), and
 *      take the appropriate actions.
 *   d. It should then interact the PHY to clear any pending
 *      interrupts, then re-enable the PHY interrupt.
 *
 *    * This is an OS internal interface and should not be used from
 *      application space.  Rather applications should use the SIOCMIISIG
 *      ioctl to receive a signal when a PHY event occurs.
 *   ** This interrupt is really of no use if the Ethernet MAC driver
 *      does not support these ioctl calls.
 *
 * Input Parameters:
 *   intf    - Identifies the network interface.  For example "eth0".  Only
 *             useful on platforms that support multiple Ethernet interfaces
 *             and, hence, multiple PHYs and PHY interrupts.
 *   handler - The client interrupt handler to be invoked when the PHY
 *             asserts an interrupt.  Must reside in OS space, but can
 *             signal tasks in user space.  A value of NULL can be passed
 *             in order to detach and disable the PHY interrupt.
 *   arg     - The argument that will accompany the interrupt
 *   enable  - A function pointer that be unused to enable or disable the
 *             PHY interrupt.
 *
 * Returned Value:
 *   Zero (OK) returned on success; a negated errno value is returned on
 *   failure.
 *
 ****************************************************************************/

#if defined(CONFIG_ARCH_PHY_INTERRUPT)
int arch_phy_irq(const char *intf, xcpt_t handler, void *arg,
                 phy_enable_t *enable)
{
  /* Using  ET0_LINKSTA for PHY interrupt line which is connected to ETHERC.
   * Interrupt will generate on common line EINT0 which is
   * used for all other interrupt as well.
   */

  struct ra6m5_ethmac_s *priv = NULL;
  irqstate_t flags;
  phy_enable_t enabler;

  DEBUGASSERT(intf);

  ninfo("%s: handler=%p\n", intf, handler);
  phyinfo("EMAC0: devname=%s\n", RA6M5_EMAC0_DEVNAME);

  if (strcmp(intf, RA6M5_EMAC0_DEVNAME) == 0)
    {
      phyinfo("Select EMAC0\n");
      priv = &g_rx65nethmac[0];
    }
  else
    {
      nerr("ERROR: Unsupported interface: %s\n", intf);
      return -ENODEV;
    }

  flags = enter_critical_section();

  if (priv != NULL)
    {
      ra6m5_phyintenable(false);
    }

  /* Configure the interrupt */

  if (handler)
    {
      phylinknotification.phandler = handler;
      phylinknotification.penable = enable;
      phylinknotification.pclient = arg;
      enabler  = ra6m5_phyintenable;
    }
  else
    {
      phylinknotification.phandler = NULL;
      phylinknotification.penable = NULL;
      phylinknotification.pclient = NULL;
      enabler = NULL;
    }

  /* Return the enabling function pointer */

  if (enable)
    {
      *enable = enabler;
    }

  /* Return the old handler (so that it can be restored) */

  leave_critical_section(flags);
  return OK;
}
#endif

/****************************************************************************
 * Function Name: phy_start_autonegotiate
 * Description  : Starts auto-negotiate
 * Arguments    : pause -
 *                    Using state of pause frames
 * Return Value : none
 ****************************************************************************/

void phy_start_autonegotiate(struct ra6m5_ethmac_s *priv, uint8_t pause)
{
  volatile uint16_t regval = 0;

  /* Set local ability */

  /* When pause frame is not used */

  if (ETHER_FLAG_OFF == pause)
    {
      regval = ((((PHY_AN_ADVERTISEMENT_100F |
                   PHY_AN_ADVERTISEMENT_100H) |
                   PHY_AN_ADVERTISEMENT_10F) |
                   PHY_AN_ADVERTISEMENT_10H) |
                   PHY_AN_ADVERTISEMENT_SELECTOR);
    }

  /* When pause frame is used */

  else
    {
      regval = ((((((PHY_AN_ADVERTISEMENT_ASM_DIR |
                     PHY_AN_ADVERTISEMENT_PAUSE) |
                     PHY_AN_ADVERTISEMENT_100F) |
                     PHY_AN_ADVERTISEMENT_100H) |
                     PHY_AN_ADVERTISEMENT_10F) |
                     PHY_AN_ADVERTISEMENT_10H) |
                     PHY_AN_ADVERTISEMENT_SELECTOR);
    }

  /* Configure what the PHY and the Ethernet controller on this board
   * supports
   */

  ra6m5_phywrite(priv->phyaddr,
                           PHY_REG_AN_ADVERTISEMENT, regval);
  ra6m5_phywrite(priv->phyaddr, PHY_REG_CONTROL,
                      (PHY_CONTROL_AN_ENABLE | PHY_CONTROL_AN_RESTART));
}

/****************************************************************************
 * Function Name: ra6m5_power_on_control
 * Description  : Powers on the channel if the ETHEC channel
 *                used and the PHY access channel are different, or if the
 *                PHY access channel is powered off.
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

