gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
void ra6m5_power_on_control(void)
{
}

/****************************************************************************
 * Function Name: ra6m5_ether_set_phy_mode
 * Description  : Set port connect for Mode selection
 * Arguments    : mode -
 *                    phy mode
 * Return Value : none
 ****************************************************************************/

void ra6m5_ether_set_phy_mode(uint8_t mode)
{
  if (PHY_MII_SET_MODE == mode)
    {
      /* MII */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_MII_MODE, RA6M5_MPC_PFENET);
    }
  else if (PHY_RMII_SET_MODE == mode)
    {
      /* RMII */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_RMII_MODE, RA6M5_MPC_PFENET);
    }
  else
    {
      /* By Default MII will be selected */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_MII_MODE, RA6M5_MPC_PFENET);
    }
}

/****************************************************************************
 * Function Name: phy_reg_read
 * Description  : Reads PHY register through MII interface
 * Arguments    : pdata -
 *                    pointer to store the data read
 * Return Value : none
 ****************************************************************************/

static void phy_reg_read(uint16_t *pdata)
{
  int32_t databitcnt = 0;
  int32_t j;
  uint16_t reg_data;

  /* The processing of DATA (data) about reading of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of
   * "IEEE 802.3-2008_section2".
   */

  reg_data = 0;
  databitcnt = 16; /* Number of bit to read */

  while (databitcnt > 0) /* reading 1 bit per loop */
    {
      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Reset All Flags of PIR */

          ra6m5_putreg(ETH_PIR_RESET_ALL, RA6M5_ETH_PIR);
        }

      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Setting MDC of PIR */

          ra6m5_putreg(ETH_PIR_SET_MDC, RA6M5_ETH_PIR);
        }

      reg_data <<= 1;

      /* MDI read  */

      reg_data |= (uint16_t) (((ra6m5_getreg(RA6M5_ETH_PIR))
                                                  & ETH_PIR_MDI) >> 3);

      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Setting MDC of PIR */

          ra6m5_putreg(ETH_PIR_SET_MDC, RA6M5_ETH_PIR);
        }

      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          ra6m5_putreg(ETH_PIR_RESET_ALL, RA6M5_ETH_PIR); /* Reset All Flags of PIR */
        }

      databitcnt--;
    }

  (*pdata) = reg_data;
}

/****************************************************************************
 * Function Name: ra6m5_phyread
 * Description  : Reads a PHY register
 * Arguments    : phydevaddr -
 *                    Phy address
 *                reg_addr -
 *                    address of the PHY register
 * Return Value : read value
 ****************************************************************************/

static uint16_t ra6m5_phyread(uint8_t phydevaddr, uint16_t reg_addr,
                              uint16_t *value)
{
  uint16_t data;

  /* The value is read from the PHY register by the frame format
   * of MII Management Interface provided
   * for by Table 22-12 of 22.2.4.5 of
   * IEEE 802.3-2008_section2.
   */

  ra6m5_phy_preamble();
  ra6m5_phy_reg_set(phydevaddr, reg_addr, PHY_MII_READ);
  ra6m5_phy_trans_zto0();
  phy_reg_read(&data);
  ra6m5_phy_trans_zto0();
  *value = data;
  return OK;
}

/****************************************************************************
 * Function Name: ra6m5_ether_enable_icu
 * Description  :
 * Arguments    :
 * Return Value : none
 ****************************************************************************/

void ra6m5_ether_enable_icu(void)
{

}

/****************************************************************************
 * Function Name: ra6m5_phy_trans_zto0
 * Description  : Performs bus release so that PHY can drive data
 *              : for read operation
 * Arguments    : ether_channel -
 *                    Ethernet channel number
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_trans_zto0(void)
{
  int32_t j;

  /* The processing of TA (turnaround) about reading of the frame format of
   * MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
          /* Resetting All flags of PIR */

      ra6m5_putreg(ETH_PIR_RESET_ALL, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      ra6m5_putreg(ETH_PIR_SET_MDC, RA6M5_ETH_PIR); /* Setting MDC of PIR */
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      ra6m5_putreg(ETH_PIR_SET_MDC, RA6M5_ETH_PIR); /* Setting MDC of PIR */
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Resetting All flags of PIR */

      ra6m5_putreg(ETH_PIR_RESET_ALL, RA6M5_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: ra6m5_phy_trans_1to0
 * Description  : Switches data bus so MII interface can drive data
 *              : for write operation
 * Arguments    : ether_channel -
 *                    Ethernet channel number
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_trans_1to0(void)
{
  /* The processing of TA (turnaround) about writing of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  ra6m5_phy_mii_write1();
  ra6m5_phy_mii_write0();
}

/****************************************************************************
 * Function Name: ra6m5_phy_reg_set
 * Description  : Sets a PHY device to read or write mode
 * Arguments    : phydevaddr -
 *                    Phy address
 *                reg_addr -
 *                    address of the PHY register
 *                option -
 *                    mode
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_reg_set(uint8_t phydevaddr, uint16_t reg_addr,
                              int32_t option)
{
  int32_t bitcnt = 0;
  uint16_t data;

  /* The processing of ST (start of frame),
   * OP (operation code), PHYAD (PHY Address), and
   * REGAD (Register Address)  about the frame format of
   * MII Management Interface which is
   * provided by "Table 22-12" of
   * "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  data = 0;
  data = (PHY_MII_ST << 14); /* ST code    */
  if (PHY_MII_READ == option)
    {
      data |= (PHY_MII_READ << 12); /* OP code(RD)  */
    }
  else
    {
      data |= (PHY_MII_WRITE << 12); /* OP code(WR)  */
    }

  data |= (uint16_t) (phydevaddr << 7); /* PHY Address configured 0x1e  in decimal 30 */
  data |= (reg_addr << 2);
  bitcnt = 14;  /* These number of bits to send for ST, OP, PHYAD and REGAD */
  while (bitcnt > 0)
    {
      if (0 == (data & 0x8000))
        {
          ra6m5_phy_mii_write0();
        }
      else
        {
          ra6m5_phy_mii_write1();
        }

      data <<= 1;
      bitcnt--;
    }
}

/****************************************************************************
 * Function Name: ra6m5_phy_reg_write
 * Description  : Writes to PHY register through MII interface
 * Arguments    :  data -
 *                value to write
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_reg_write(uint16_t data)
{
  int32_t databitcnt = 0;

  /* The processing of DATA (data) about writing of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   */

  databitcnt = 16;       /* Number of bit to write */
  while (databitcnt > 0) /* writing 1 bit per loop */
    {
      if (0 == (data & 0x8000))
        {
          ra6m5_phy_mii_write0();
        }
      else
        {
          ra6m5_phy_mii_write1();
        }

      databitcnt--;
      data <<= 1;
    }
}

/****************************************************************************
 * Function Name: ra6m5_phy_mii_write1
 * Description  : Outputs 1 to the MII interface
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

