gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
static void ra6m5_phy_mii_write1(void)
{
  int32_t j;

  /* The processing of one bit about frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   * The data that 1 is output.
   */

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO and MMD and by default MDI */

       ra6m5_putreg(ETH_PIR_SET_MDO_MMD, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO, MMD and MDC and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MDO_MMD_MDC, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO, MMD and MDC and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MDO_MMD_MDC, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO and MMD and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MDO_MMD, RA6M5_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: ra6m5_phy_mii_write0
 * Description  : Outputs 0 to the MII interface
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_mii_write0(void)
{
  int32_t j;

  /* The processing of one bit about frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   * The data that 0 is output.
   */

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MMD and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MMD, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDC and MMD and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MMD_MDC, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDC and MMD and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MMD_MDC, RA6M5_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MMD and by default MDI */

      ra6m5_putreg(ETH_PIR_SET_MMD, RA6M5_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: ra6m5_phy_preamble
 * Description  : As preliminary preparation for access
 *                to the PHY module register,
 *                "1" is output via the MII management interface.
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

static void ra6m5_phy_preamble(void)
{
  int16_t preamble_bits = 0;

  /* The processing of PRE (preamble) about the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   */

  /* Send 32 consecutive 1’s as per 34.3.4.1
   * MII/RMII Management Frame Format
   */

  preamble_bits = 32;
  while (preamble_bits > 0)
    {
      ra6m5_phy_mii_write1();
      preamble_bits--;
    }
}

/****************************************************************************
 * Function Name: ra6m5_phywrite
 * Description  : Writes to a PHY register
 * Arguments    : phydevaddr -
 *                    Phy device address
 *                reg_addr -
 *                    address of the PHY register
 *                data -
 *                    value
 * Return Value : none
 ****************************************************************************/

static int ra6m5_phywrite (uint8_t phydevaddr, uint16_t reg_addr,
                           uint16_t data)
{
  /* The value is read from the PHY register by the frame format
   * of MII Management Interface provided
   * for by Table 22-12 of 22.2.4.5 of IEEE 802.3-2008_section2.
   */

  ra6m5_phy_preamble();
  ra6m5_phy_reg_set(phydevaddr, reg_addr, PHY_MII_WRITE);
  ra6m5_phy_trans_1to0();
  ra6m5_phy_reg_write(data);
  ra6m5_phy_trans_zto0();
  return OK;
}

/****************************************************************************
 * Function Name: ra6m5_ether_interrupt_init
 * Description  : Writes to a ETHERC/EDMAC register
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

void ra6m5_ether_interrupt_init(void)
{
  uint32_t regval;

  /* Start interrupt control unit for ethernet interrupt */

  ra6m5_ether_enable_icu();

  /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */

  ra6m5_putreg(ETH_ECSR_CLR, RA6M5_ETH_ECSR);

  /* Clear all EDMAC status bits */

  ra6m5_putreg(ETHD_EESR_EDMAC, RA6M5_ETHD_EESR);

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval &= (~(ETH_ECSIPR_LCHNGIP));
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  /* ETHERC status interrupt request is disabled */

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval &= (~(ETHD_EESIPR_ECIIP));
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);
}

/****************************************************************************
 * Function: ra6m5_phyinit
 *
 * Description:
 *  Configure the PHY and determine the link speed/duplex.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_phyinit(struct ra6m5_ethmac_s *priv)
{
  uint32_t count = 0;
  uint8_t  phyaddr;
  uint16_t reg;
  int retries;
  int ret;

  /* Loop (potentially infinitely?) until we successfully communicate with
   * the PHY.
   */

  for (phyaddr = 0; phyaddr < 32; phyaddr++)
    {
      ninfo("%s: Try phyaddr: %u\n", BOARD_PHY_NAME, phyaddr);

      /* Try to read PHYID1 few times using this address */

      retries = 0;
      do
        {
          nxsig_usleep(LINK_WAITUS);
          ninfo("%s: Read PHYID1, retries=%d\n",
                BOARD_PHY_NAME, retries + 1);
          reg = 0xffff;
          ret = ra6m5_phyread(phyaddr, MII_PHYID1, &reg);
        }
      while ((ret < 0 || reg == 0xffff) && ++retries < 3);

