gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
      /* If we successfully read anything then break out, using this PHY
       * address
       */

      if (retries < 3)
        {
          break;
        }
    }

  if (phyaddr >= 32)
    {
      nerr("ERROR: Failed to read PHYID1 at any address\n");
      return -ENOENT;
    }

  ninfo("%s: Using PHY address %u\n", BOARD_PHY_NAME, phyaddr);
  priv->phyaddr = phyaddr;

  /* Verify PHYID1.  Compare OUI bits 3-18 */

  ninfo("%s: PHYID1: %04x\n", BOARD_PHY_NAME, reg);
  if (reg != BOARD_PHYID1)
    {
      nerr("ERROR: PHYID1=%04x incorrect for %s.  Expected %04x\n",
           reg, BOARD_PHY_NAME, BOARD_PHYID1);
      return -ENXIO;
    }

  /* Read PHYID2 */

  ret = ra6m5_phyread(phyaddr, MII_PHYID2, &reg);
  if (ret < 0)
    {
      nerr("ERROR: Failed to read %s PHYID2: %d\n", BOARD_PHY_NAME, ret);
      return ret;
    }

  ninfo("%s: PHYID2: %04x\n", BOARD_PHY_NAME, reg);

  /* Verify PHYID2:  Compare OUI bits 19-24 and the 6-bit model number
   * (ignoring the 4-bit revision number).
   */

  if ((reg & 0xfff0) != (BOARD_PHYID2 & 0xfff0))
    {
      nerr("ERROR: PHYID2=%04x incorrect for %s.  Expected %04x\n",
           (reg & 0xfff0), BOARD_PHY_NAME, (BOARD_PHYID2 & 0xfff0));
      return -ENXIO;
    }

#ifdef CONFIG_RA6M5_EMAC0_AUTONEG
  /*  Software Reset the PHY */

    ret = ra6m5_phywrite(priv->phyaddr,
                         PHY_REG_CONTROL, PHY_CONTROL_RESET);

  /* Reset completion waiting */

  do
    {
      ret = ra6m5_phyread(priv->phyaddr,
                          PHY_REG_CONTROL, &reg);
      count++;
    }
  while ((reg & PHY_CONTROL_RESET) && (count < ETHER_CFG_PHY_DELAY_RESET));

  if (count > ETHER_CFG_PHY_DELAY_RESET)
    {
      return -ETIMEDOUT;
    }

  priv->mbps100 = 0;
  priv->fduplex = 0;

  /* Initialize the PHY Auto negotiation with frame pause disable */

  phy_start_autonegotiate (priv, PAUSE_FRAME_DISABLE);

  /* Interrupt initialization */

  ra6m5_ether_interrupt_init();

  /* To check the Link status in PHY registers read Auto-negotiation
   * Advertisement register
   */

  ret = ra6m5_phyread(priv->phyaddr, PHY_REG_STATUS, &reg);

  count = 0;
  do
    {
      /* Reading PHY status register after negotiation */

      ret = ra6m5_phyread(priv->phyaddr, PHY_REG_STATUS, &reg);
      count++;
    }
  while ((!((reg & (PHY_VALID_LINK | PHY_AUTO_NEG_DONE))
                         || (count > ETHER_PHY_STATUS_CHECK_DELAY))));

  if (count > ETHER_PHY_STATUS_CHECK_DELAY)
    {
      return -ETIMEDOUT;
    }

#ifdef CONFIG_RA6M5_EMAC0_PHYSR_ALTCONFIG
  ret = ra6m5_phyread(priv->phyaddr, CONFIG_RA6M5_PHYSR, &reg);
  switch (reg & CONFIG_RA6M5_EMAC0_PHYSR_ALTMODE)
    {
      default:
      case CONFIG_RA6M5_EMAC0_PHYSR_10HD:
        priv->fduplex = 0;
        priv->mbps100 = 0;
        break;

      case CONFIG_RA6M5_EMAC0_PHYSR_100HD:
        priv->fduplex = 0;
        priv->mbps100 = 1;
        break;

      case CONFIG_RA6M5_EMAC0_PHYSR_10FD:
        priv->fduplex = 1;
        priv->mbps100 = 0;
        break;

      case CONFIG_RA6M5_EMAC0_PHYSR_100FD:
        priv->fduplex = 1;
        priv->mbps100 = 1;
        break;
    }
#else
  if ((reg & CONFIG_RA6M5_EMAC0_PHYSR_FULLDUPLEX) != 0)
    {
      priv->fduplex = 1;
    }

  if ((reg & CONFIG_RA6M5_EMAC0_PHYSR_100MBPS) != 0)
    {
      priv->mbps100 = 1;
    }
#endif /* CONFIG_RA6M5_EMAC0_PHYSR_ALTCONFIG */
#endif /* CONFIG_RA6M5_EMAC0_AUTONEG */

  return ret;
}

/****************************************************************************
 * Function: ra6m5_ethgpioconfig
 *
 * Description:
 *  Configure GPIOs for the Ethernet interface.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void ra6m5_ethgpioconfig(struct ra6m5_ethmac_s *priv)
{
  /* Configure power control pins */

  ra6m5_configgpio(GPIO_ETH_PWR);
  ra6m5_configgpio(GPIO_ETH_RST);
  ra6m5_configgpio(GPIO_ETH_INT);

  /* Configure RMII pins */

  ra6m5_configgpio(GPIO_ETH_MDC);
  ra6m5_configgpio(GPIO_ETH_MDIO);
  ra6m5_configgpio(GPIO_ETH_REFCLKI);
  ra6m5_configgpio(GPIO_ETH_TXD0);
  ra6m5_configgpio(GPIO_ETH_TXD1);
  ra6m5_configgpio(GPIO_ETH_TX_EN);
  ra6m5_configgpio(GPIO_ETH_RXD0);
  ra6m5_configgpio(GPIO_ETH_RXD1);
  ra6m5_configgpio(GPIO_ETH_RX_ER);
  ra6m5_configgpio(GPIO_ETH_CRS_DV);
}

/****************************************************************************
 * Function: ra6m5_ethreset
 *
 * Description:
 *  Reset the Ethernet block.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   Zero on success, or a negated errno value on any failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_ethreset(struct ra6m5_ethmac_s *priv)
{
  uint32_t regval;
  uint32_t retries;

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval &= (~(ETH_ECSIPR_LCHNGIP));
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval &= (~(ETHD_EESIPR_ECIIP));
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);

  /* Disable TE and RE in ECMR Register */

  /* ra6m5_putreg(ETH_ECMR_CLR, RA6M5_ETH_ECMR); */

  regval  = ra6m5_getreg(RA6M5_ETH_ECMR);
  regval &= (~(ETH_ECMR_TE | ETH_ECMR_RE));
  ra6m5_putreg(regval, RA6M5_ETH_ECMR);

  /* Perform a software reset by setting the SWR bit in the EDMR register.
   * When 1 is written, the EDMAC and ETHERC are reset
   */

  /* Registers TDLAR, RDLAR, RMFCR TFUCR and RFOCR are not reset */

  regval  = ra6m5_getreg(RA6M5_ETHD_EDMR);
  regval |= ETHD_EDMR_SWR;
  ra6m5_putreg(regval, RA6M5_ETHD_EDMR);

  /* Wait for software reset to complete. The SR bit is cleared automatically
   * after the reset operation has completed in all of the core clock
   * domains.
   */

  retries = 10;
  while (((ra6m5_getreg(RA6M5_ETHD_EDMR) & ETHD_EDMR_SWR) != 0) &&
         retries > 0)
    {
      retries--;
      up_mdelay(10);
    }

  if (retries == 0)
    {
      return -ETIMEDOUT;
    }

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval |= (ETH_ECSIPR_LCHNGIP);
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval |= (ETHD_EESIPR_ECIIP);
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);

