gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
  return 0;
}

/****************************************************************************
 * Function: ra6m5_macconfig
 *
 * Description:
 *  Configure the Ethernet MAC for DMA operation.
 *  Software reset has to be executed, and ETHERC and EDMAC are configured.
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_macconfig(struct ra6m5_ethmac_s *priv)
{
  uint32_t regval;
  uint32_t retries;

  /* Perform a software reset by setting the SWR bit in the EDMR register.
   * When 1 is written, the EDMAC and ETHERC are reset
   */

  /* Registers TDLAR, RDLAR, RMFCR TFUCR and RFOCR are not reset */

  regval  = ra6m5_getreg(RA6M5_ETHD_EDMR);
  regval |= ETHD_EDMR_SWR;
  ra6m5_putreg(regval, RA6M5_ETHD_EDMR);

  retries = 10;
  while (((ra6m5_getreg(RA6M5_ETHD_EDMR) & ETHD_EDMR_SWR) != 0) &&
         retries > 0)
    {
      retries--;
      up_mdelay(10);
    }

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval |= (ETH_ECSIPR_LCHNGIP);
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval |= (ETHD_EESIPR_ECIIP);
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);

  ra6m5_macaddress(priv);

  return OK;
}

/****************************************************************************
 * Function: ra6m5_macaddress
 *
 * Description:
 *   Configure the selected MAC address.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void ra6m5_macaddress(struct ra6m5_ethmac_s *priv)
{
  struct net_driver_s *dev = &priv->dev;
  uint32_t regval;
  regval = 0;

  ninfo("%s MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        dev->d_ifname,
        dev->d_mac.ether.ether_addr_octet[0],
                     dev->d_mac.ether.ether_addr_octet[1],
        dev->d_mac.ether.ether_addr_octet[2],
                     dev->d_mac.ether.ether_addr_octet[3],
        dev->d_mac.ether.ether_addr_octet[4],
                    dev->d_mac.ether.ether_addr_octet[5]);

  /* Set the MAC address high register */

  regval = (((((uint32_t) dev->d_mac.ether.ether_addr_octet[0] << 24) |
              ((uint32_t) dev->d_mac.ether.ether_addr_octet[1] << 16))
           | ((uint32_t) dev->d_mac.ether.ether_addr_octet[2] << 8)) |
                   (uint32_t) dev->d_mac.ether.ether_addr_octet[3]);
  ra6m5_putreg(regval, RA6M5_ETH_MAHR);

  /* Set the MAC address low register */

  regval = 0;
  regval = (((uint32_t) dev->d_mac.ether.ether_addr_octet[4] << 8) |
             (uint32_t)dev->d_mac.ether.ether_addr_octet[5]);
  ra6m5_putreg(regval, RA6M5_ETH_MALR);
}

/****************************************************************************
 * Function: ra6m5_ethconfig
 *
 * Description:
 *  Configure the Ethernet interface for operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int ra6m5_ethconfig(struct ra6m5_ethmac_s *priv)
{
  int ret;
  uint32_t regval;

  /* Reset the Ethernet block */

  ninfo("Reset the Ethernet block\n");
  ret = ra6m5_ethreset(priv);
  if (ret < 0)
    {
      nerr("ERROR: Reset of Ethernet block failed\n");
      return ret;
    }

  /* Initialize the PHY selection Set port connect
   * Currently we are using RMII
   */

  ra6m5_ether_set_phy_mode(PHY_RMII_SET_MODE);

  /* ETHERC/EDMAC Power on */

  ra6m5_power_on_control();

  /* Initialize the PHY */

  ninfo("Initialize the PHY\n");
  ret = ra6m5_phyinit(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Initialize the MAC and Ethernet DMA */

  ninfo("Initialize the MAC and DMA\n");
  ret = ra6m5_macconfig(priv);
  if (ret < 0)
    {
      return ret;
    }

#ifndef CONFIG_ENDIAN_BIG

  /* Set little endian mode */

  regval  = ra6m5_getreg(RA6M5_ETHD_EDMR);
  regval |= ETHD_EDMR_DE;
  ra6m5_putreg(regval, RA6M5_ETHD_EDMR);
#endif

  /* Initialize the free buffer list */

  ra6m5_initbuffer(priv);

  /* Initialize TX Descriptors list: Chain Mode */

  ra6m5_txdescinit(priv);

  /* Initialize RX Descriptors list: Chain Mode  */

  ra6m5_rxdescinit(priv);

  /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */

  ra6m5_putreg(ETH_ECSR_CLR, RA6M5_ETH_ECSR);

  /* Clear all EDMAC status bits */

  ra6m5_putreg(ETHD_EESR_EDMAC, RA6M5_ETHD_EESR);

  /* Interrupt configuration */

  /* Notification of ET0_LINKSTA signal change interrupt */

  regval  = ra6m5_getreg(RA6M5_ETH_ECSR);
  regval |= ((ETH_ECSR_LCHNG)); /* Write 1 to clear flag */
  ra6m5_putreg(regval, RA6M5_ETH_ECSR);
  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval |= ((ETH_ECSIPR_LCHNGIP));
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  /* ETHERC/EDMAC enabling Status Interrupt */

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval |= ((ETHD_EESIPR_ECIIP));
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);

  /* Ethernet length 1514bytes + CRC and */

  ra6m5_putreg(ETH_RFLR_RFL, RA6M5_ETH_RFLR);

  /* Intergap is 96-bit time */

  ra6m5_putreg(ETH_IPGR_IPG_INITIAL, RA6M5_ETH_IPGR);

  /* Continuous reception number of Broadcast frame */

  regval  = ra6m5_getreg(RA6M5_ETH_BCFRR);
  regval |= (ETH_BCFRR_BCF);
  ra6m5_putreg(regval, RA6M5_ETH_BCFRR);

  regval  = ra6m5_getreg(RA6M5_ETHD_TRSCER);
  if (ETHER_MC_FILTER_ON == priv->mc_filter_flag)
    {
  /* Reflect the EESR.RMAF bit status in the RD0.RFS bit
   * in the receive descriptor
   */

      regval &= (~((ETHD_TRSCER_RMAFCE) | (ETHD_TRSCER_RRFCE)));
      ra6m5_putreg(regval, RA6M5_ETHD_TRSCER);
    }
  else
    {
  /* Don't reflect the EESR.RMAF bit status in the RD0.RFS
   * bit in the receive descriptor
   */

      regval &= (~(ETHD_TRSCER_RRFCE));
      regval |= (ETHD_TRSCER_RMAFCE);
      ra6m5_putreg(regval, RA6M5_ETHD_TRSCER);
    }

  /* Threshold of Tx_FIFO */

  ra6m5_putreg(ETHD_TFTR_TFT, RA6M5_ETHD_TFTR); /* Store and forward mode */

  /* transmit fifo is 1968 bytes & receive fifo is 2048 bytes */

  regval  = ra6m5_getreg(RA6M5_ETHD_FDR);
  regval |= ((ETHD_FDR_RFD) | (ETHD_FDR_TFD));
  ra6m5_putreg(regval, RA6M5_ETHD_FDR);

