gmtcontrol/nuttx/arch/arm/src/ra6m5/ra6m5_eth.c
  /* Configure receiving method */

  /* b0      RNR - Receive Request Bit Reset - Continuous reception
   * of multiple frames is possible.
   * b31:b1  Reserved set to 0
   */

  regval  = ra6m5_getreg(RA6M5_ETHD_RMCR);
  regval |= (ETHD_RMCR_RNR);
  ra6m5_putreg(regval, RA6M5_ETHD_RMCR);

  /* Transmit Interrupt Setting */

  regval  = ra6m5_getreg(RA6M5_ETHD_TRIMD);
  regval |= ((ETHD_TRIMD_TIS) | (ETHD_TRIMD_TIM));
  ra6m5_putreg(regval, RA6M5_ETHD_TRIMD);

  /* ETHERC/EDMAC enabling Interrupt */

  regval  = ra6m5_getreg(RA6M5_ETHD_EESIPR);
  regval |= ((ETHD_EESIPR_TCIP) | (ETHD_EESIPR_FRIP) | (ETHD_EESIPR_ECIIP));
  ra6m5_putreg(regval, RA6M5_ETHD_EESIPR);

  regval  = ra6m5_getreg(RA6M5_ETH_ECSIPR);
  regval |= ((ETH_ECSIPR_LCHNGIP));
  ra6m5_putreg(regval, RA6M5_ETH_ECSIPR);

  /* Enabling TE and RE and set DM mode  */

  regval  = ra6m5_getreg(RA6M5_ETH_ECMR);
  regval  |= ETH_ECMR_RE;
  regval  |= ETH_ECMR_TE;
  if (priv->fduplex)
    {
      regval  |= ETH_ECMR_DM;
    }
  else
    {
      regval  &= (~ETH_ECMR_DM);
    }

  if (priv->mbps100)
    {
      regval  |= ETH_ECMR_RTM;
    }
  else
    {
      regval  &= (~ETH_ECMR_RTM);
    }

  ra6m5_putreg(regval, RA6M5_ETH_ECMR);

  /* Start DMA reception */

  regval  = ra6m5_getreg(RA6M5_ETHD_EDRRR);
  regval |= (ETHD_EDRRR_RR);
  ra6m5_putreg(regval, RA6M5_ETHD_EDRRR);

  return ret;
}

/****************************************************************************
 * Function: ra6m5_ethinitialize
 *
 * Description:
 *   Initialize the EMAC driver.
 *
 * Input Parameters:
 *   intf - If multiple EMAC peripherals are supported, this identifies the
 *     the EMAC peripheral being initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *   Called very early in the initialization sequence.
 *
 ****************************************************************************/

int ra6m5_ethinitialize(int intf)
{
  struct ra6m5_ethmac_s *priv;
  int ret;

  /* Initialize hardware mac address */

  uint8_t mac[6];
  mac[0] = 0x00;
  mac[1] = 0x25;
  mac[2] = 0xfc;
  mac[3] = 0x01;
  mac[4] = 0xaa;
  mac[5] = 0x55;

  ninfo("intf: %d\n", intf);

  /* Get the interface structure associated with this interface number. */

  DEBUGASSERT(intf < RA6M5_NETHERNET);

  priv = &g_rx65nethmac[intf];

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct ra6m5_ethmac_s));

  /* I/F up (new IP address) callback */

  priv->dev.d_ifup    = ra6m5_ifup;

  /* I/F down callback */

  priv->dev.d_ifdown  = ra6m5_ifdown;
  priv->dev.d_txavail = ra6m5_txavail;  /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->dev.d_addmac  = ra6m5_addmac;   /* Add multicast MAC address */
  priv->dev.d_rmmac   = ra6m5_rmmac;    /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = ra6m5_ioctl;    /* Support PHY ioctl() calls */
#endif

  /* Used to recover private state from dev */

  priv->dev.d_private = g_rx65nethmac;

  /* Multi cast flag */

  priv->mc_filter_flag = ETHER_MC_FILTER_OFF;

  /* hw mac address */

  priv->dev.d_mac.ether.ether_addr_octet[0] =  mac[0];
  priv->dev.d_mac.ether.ether_addr_octet[1] =  mac[1];
  priv->dev.d_mac.ether.ether_addr_octet[2] =  mac[2];
  priv->dev.d_mac.ether.ether_addr_octet[3] =  mac[3];
  priv->dev.d_mac.ether.ether_addr_octet[4] =  mac[4];
  priv->dev.d_mac.ether.ether_addr_octet[5] =  mac[5];

  /* Configure GPIO pins to support Ethernet */

  ra6m5_ethgpioconfig(priv);

  /* Enable selected ETHERC/EDMAC Channel. */

  modifyreg32(RA6M5_MSTP_REG(RA6M5_MSTP_MSTPCRB_OFFSET), MSTP_MSTPCRB_EMAC, 0);

  /* Attach the IRQ to the driver */

  if (irq_attach(RA6M5_IRQ_ETH, ra6m5_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Put the interface in the down state. */

  ret = ra6m5_ifdown(&priv->dev);
  if (ret < 0)
    {
      nerr("ERROR: Initialization of Ethernet block failed: %d\n", ret);
      return ret;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Function: arm_netinitialize
 *
 * Description:
 *   This is the "standard" network initialization logic called from the
 *   low-level initialization logic in up_initialize.c.  If RA6M5_NETHERNET
 *   greater than one, then board specific logic will have to supply a
 *   version of arm_netinitialize() that calls ra6m5_ethinitialize() with
 *   the appropriate interface number.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if defined (CONFIG_NET) && !defined(CONFIG_NETDEV_LATEINIT)
void arm_netinitialize(void)
{
  int ret;

#if defined(CONFIG_RA6M5_EMAC0)

  /* Initialize the EMAC0 driver */

  ret = ra6m5_ethinitialize(EMAC0_INTF);
  if (ret < 0)
    {
      nerr("ERROR: up_emac_initialize(EMAC0) failed: %d\n", ret);
    }
#endif
}
#endif
#endif /* RA6M5_NETHERNET > 0 */
#endif /* CONFIG_NET && CONFIG_RA6M5_EMAC */
